% Вариант 5:
% 2*x1 - cos(x2 + 1) = 0  => x1 = cos(x2 + 1)/2
% x2 + sin(x1) = -0.4     => x1 = arcsin(-0.4 - x2)


% Очистка
clear all; clc;

% Область для x2
x2 = linspace(-2, 2, 1000);

% Первая функция
x1_1 = cos(x2 + 1) / 2;

% Вторая функция (только где arcsin определен)
x1_2 = asin(-x2 - 0.4);

% Построение графика
plot(x2, x1_1, 'b', 'LineWidth', 1);
hold on;
plot(x2, x1_2, 'r', 'LineWidth', 1);
grid on;
xlim([-1.3, -0.5]);
ylim([0, 1]);
xlabel('x_2');
ylabel('x_1');
legend('x_1 = cos(x_2+1)/2', 'x_1 = arcsin(-x_2-0.4)');

% интервалы локализации -> [x2_a, x2_b] = [-1.3, -0.5], [x1_a, x1_b] = [0, 1]

% решение с помощью fsolve()
function y = F(x)
    y = [2*x(1) - cos(x(2) + 1);
         x(2) + sin(x(1)) + 0.4];
end

% Решение
x_fsolve = [0.5; -0.9]; % я взял середину интервалов [x1, x2]
solution_fsolve = fsolve(@F, x_fsolve);
disp('Решение fsolve:');
disp(solution_fsolve);

% якоби
J = [0, -0.0499167;
     -0.877583, 0];

q = norm(J, 1);
fprintf('q=');
disp(q);

% Проверка условия сходимости
if q >= 1
    fprintf('Внимание: условие сходимости не выполнено (q >= 1)\n');
else
    fprintf('Условие сходимости выполнено (q < 1)\n');
end


% параметры
x0 = [0.5; -0.9]; % начальное приближение
epsilon = 1e-4;

k = 0; % Счетчик итераций
x_old = x0; % x^(0) - начальное приближение

epsilon0 = ((1-q) / q) * epsilon;

diff_norm = epsilon0 + 1;

fprintf('┌─────┬────────────┬────────────┬──────────────────┬────────────────────┐\n');
fprintf('│ №   │    x1      │    x2      │ ‖x^(k)-x^(k-1)‖  │ точность           │\n');
fprintf('├─────┼────────────┼────────────┼──────────────────┼────────────────────┤\n');

while diff_norm > epsilon0
  k = k + 1;
  x_new = [cos(x_old(2)+1)/2; -sin(x_old(1))-0.4];
  diff_norm = norm(x_new - x_old, 1);
  fprintf('%3d\t%.6f\t%.6f\t%.6f\t%.6f\n', ...
                k, x_new(1), x_new(2), diff_norm, epsilon0)

  x_old = x_new;

end

fprintf('└─────┴────────────┴────────────┴──────────────────┴────────────────────┘\n');

% Сравнивая две последние колонки таблицы определить номер итерации
fprintf('\n5. Точность достигнута на итерации: %d\n', k);

% Выписать решение системы x*
fprintf('\n6. Решение системы x*:\n');
fprintf('x* = [%.8f, %.8f]\n', x_new(1), x_new(2));














