% Вариант 5:
% f1(x1,x2) = 2*x1 - cos(x2 + 1) = 0
% f2(x1,x2) = x2 + sin(x1) + 0.4 = 0



% параметры
x0 = [0.5; -0.9]; % начальное приближение
epsilon = 1e-4;

k = 0; % Счетчик итераций
x_old = x0; % x^(0) - начальное приближение

diff_norm = epsilon + 1;


fprintf('┌─────┬────────────┬────────────┬──────────────────┬────────────────────┐\n');
fprintf('│ №   │    x1      │    x2      │ ‖x^(k)-x^(k-1)‖  │ точность           │\n');
fprintf('├─────┼────────────┼────────────┼──────────────────┼────────────────────┤\n');


while diff_norm > epsilon
  k = k + 1;
  x1 = x_old(1);
  x2 = x_old(2);

  f1 = 2*x1 - cos(x2 + 1);
  f2 = x2 + sin(x1) + 0.4;
  F = [f1; f2];


  J11 = 2;
  J12 = sin(x2 + 1);
  J21 = cos(x1);
  J22 = 1;

  J = [J11, J12;
       J21, J22];

  delta = -J \ F;

  x_new = x_old + delta;

  diff_norm = norm(x_new - x_old, 1);

  fprintf('%3d\t%.6f\t%.6f\t%.6f\t%.6f\n', ...
                k, x_new(1), x_new(2), diff_norm, epsilon);

  x_old = x_new;
end


fprintf('└─────┴────────────┴────────────┴──────────────────┴────────────────────┘\n');


% Сравнивая две последние колонки таблицы определить номер итерации
fprintf('\n5. Точность достигнута на итерации: %d\n', k);

% Выписать решение системы x*
fprintf('\n6. Решение системы x*:\n');
fprintf('x* = [%.8f, %.8f]\n', x_new(1), x_new(2));







